000100      ************************************************************00010000
000200      * DATA     :  24/05/2023                                    00020000
000300      * AUTOR    : VAGNER RENATO BELLACOSA                        00030000
000400      * OBJETIVO : ESTRUTURA DO COBOL AS 4 DIVISOES               00040000
000500      * CPD      : INEFE                                          00050000
000600      ************************************************************00060000
000700       IDENTIFICATION DIVISION.                                   00070000
000710      *                                                           00071000
000800       ENVIRONMENT DIVISION.                                      00080000
000810      *                                                           00081000
000900       DATA DIVISION.                                             00090000
000910      *                                                           00091000
001000       PROCEDURE DIVISION.                                        00100000
001010      *                                                           00101000
001100      ********************* FIM DO PROGRAMA **********************00110000
