      *****************************************************************
      * DATA     :  24/05/2023
      * AUTOR    : VAGNER RENATO BELLACOSA
      * OBJETIVO : IDENTIFICATION DIVISION E COMANDOS
      * CPD      : INEFE
      *****************************************************************
       IDENTIFICATION DIVISION.
      *
       PROGRAM-ID. COBOL002.
       AUTHOR. VAGNER BELLACOSA.
       DATE-WRITTEN. 23/05/24 @ 14:02:54.
       DATE-COMPILED. 2023-05-24.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
      *
       PROCEDURE DIVISION.
      *
      ********************* FIM DO PROGRAMA ****************************
